app/Controllers/DetailPenggunaController.php

SELECT *
FROM `user`
WHERE `user`.`user_id` = '9'
---
    public function index()
    {
        $dataPenggunaModel = new DataPenggunaModel();

        $data['users'] = $dataPenggunaModel->getUsersByRoles('notulen', 'pegawai');

        $userModel = new UserModel();

        $user_id = session()->get('user_id');
        $user_profile = $userModel->find($user_id);