app/Controllers/EditProfilController.php

SELECT *
FROM `user`
WHERE `user`.`user_id` = '9'
---
    public function editProfil()
    {
        $session = \Config\Services::session();
        $userId = $session->get('user_id');
        $userModel = new UserModel();
        $user = $userModel->find($userId);