app/Controllers/LihatNotulenController.php

SELECT *
FROM `dokumentasi`
SELECT *
FROM `notulensi`
---
    public function lihatnotulen($id = null)
    {
        if ($id === null) {
            throw new PageNotFoundException('ID notulensi tidak ditemukan.');
        }

        $notulensiModel = new NotulensiModel();
        $dokumentasiModel = new DokumentasiModel();
        $feedbackModel = new FeedbackModel();

        $notulensi = $notulensiModel->getNotulensiById($id);

        if (!$notulensi) {
            throw new PageNotFoundException("Notulensi dengan ID $id tidak ditemukan.");
        }

        $dokumentasi = $dokumentasiModel->getDokumentasiByNotulensiId($id);
        $agenda = is_string($notulensi['agenda']) ? explode(',', $notulensi['agenda']) : (array) $notulensi['agenda'];
        $agendaIsi = is_string($notulensi['isi']) ? explode(',', $notulensi['isi']) : (array) $notulensi['isi'];

        $data = [
            'id' => $id,
            'notulensi' => $notulensi,
            'agenda' => $agenda,
            'agendaIsi' => $agendaIsi,
            'dokumentasi' => $dokumentasi,
            'current_page' => 'notulensi',
            'allNotulensi' => $notulensiModel->findAll(),
            'allDokumentasi' => $dokumentasiModel->findAll(),
            'feedbacks' => $feedbackModel->getFeedbackByNotulensiId($id)
        ];