app/Controllers/NotulenController.php

    public function create()
    {
        // Ambil user_id dari session
        $user_id = session()->get('user_id');

        // Query untuk mengambil nama, role, dan profil foto berdasarkan user_id
        $db = \Config\Database::connect();
        $builder = $db->table('user');
        $userData = $builder->select('nama, role, profil_foto')
                            ->where('user_id', $user_id)
                            ->get()
                            ->getRowArray();
---
SELECT `nama`, `role`, `profil_foto`
FROM `user`
WHERE `user_id` = '32'