app/Controllers/ProfilNotulenController.php

SELECT *
FROM `user`
WHERE `user`.`user_id` = '26'
---
    public function profilNotulen()
    {
        $userModel = new UserModel();

        $user_id = session()->get('user_id');
        $user_profile = $userModel->find($user_id);