app/Controllers/ProfilPegawaiController.php

    public function profilPegawai()
    {
        $userModel = new UserModel();

        $user_id = session()->get('user_id');
        $user_profile = $userModel->find($user_id);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '13'