app/Controllers/RegisterController.php

INSERT INTO `user` (`username`, `nip`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('saja', '123456788987654321', 'saja@gmail.com', '$2y$10$v/LXVwnZ9jUq6z9BroJ4Ou7SqeHEogKC9mz2o1LKXa495FJlzkz2S', 'pegawai', '2025-01-13 06:51:25', '2025-01-13 06:51:25')
---
    public function register()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'username' => 'required|min_length[3]|max_length[50]',
            'nip'      => 'required|numeric|exact_length[18]|is_unique[user.nip]',
            'email'    => 'required|valid_email|is_unique[user.email]',
            'bidang'   => 'required',
            'password' => 'required|min_length[6]',
            'confirm-password' => 'required|matches[password]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            log_message('error', 'Validation errors: ' . json_encode($validation->getErrors()));
            return redirect()->back()->with('errors', $validation->getErrors());
        }

        $data = [
            'username' => $this->request->getPost('username'),
            'nip'      => $this->request->getPost('nip'),
            'email'    => $this->request->getPost('email'),
            'bidang'   => $this->request->getPost('bidang'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
            'role'     => 'pegawai',
        ];
        $userModel = new UserModel();
        try {
            $userModel->insert($data);