app/Models/DashboardAdminModel.php

    public function getTotalNotulensi()
    {
        return $this->db->table('notulensi')->countAllResults();  // Menghitung semua notulensi
---
SELECT COUNT(*) AS `numrows`
FROM `notulensi`

    public function getJumlahNotulensiPerBidang()
    {
        return $this->db->table('notulensi')
                        ->select('Bidang, COUNT(notulensi_id) AS jumlah')
                        ->groupBy('Bidang')  // Kelompokkan berdasarkan Bidang
                        ->get()
                        ->getResultArray();  // Ambil hasilnya sebagai array
---
SELECT `Bidang`, COUNT(notulensi_id) AS jumlah
FROM `notulensi`
GROUP BY `Bidang`