app/Models/DokumentasiModel.php

    public function getDokumentasiByNotulensiId($notulensiId)
    {
        return $this->where('notulensi_id', $notulensiId)->findAll();
---
SELECT *
FROM `dokumentasi`
WHERE `notulensi_id` = '1'