app/Models/FeedbackModel.php

    public function getFeedbackByNotulensiId($notulensi_id)
{
    $feedbacks = $this->where('feedback.notulensi_id', $notulensi_id)
                  ->join('user', 'user.user_id = feedback.user_id', 'left')
                  ->select('feedback.*, user.nama as user_nama, user.profil_foto')
                  ->orderBy('feedback.tanggal_feedback', 'DESC')
                  ->findAll();
---
SELECT `feedback`.*, `user`.`nama` as `user_nama`, `user`.`profil_foto`
FROM `feedback`
LEFT JOIN `user` ON `user`.`user_id` = `feedback`.`user_id`
WHERE `feedback`.`notulensi_id` = '3'
ORDER BY `feedback`.`tanggal_feedback` DESC