app/Models/NotulensiModel.php

SELECT *
FROM `notulensi`
---
    public function getAllNotulensi()
    {
        return $this->findAll();

SELECT *
FROM `notulensi`
SELECT *
FROM `notulensi`
WHERE `Bidang` = 'aptika'
---
    public function getNotulensiByUserIdAndBidang($user_id)
    {
        $db = \Config\Database::connect();

        // 1. Ambil bidang berdasarkan user_id
        $query = $db->table('notulensi')
                    ->select('Bidang')
                    ->where('user_id', $user_id)
                    ->limit(1);

        log_message('debug', 'Query Bidang: ' . $query->getCompiledSelect());

        $userBidang = $query->get()->getRowArray();

        if (!$userBidang) {
            log_message('debug', 'User ID ' . $user_id . ' tidak memiliki bidang yang terdaftar.');
            return [];
        }

        $bidang = $userBidang['Bidang'];
        $query = $db->table('notulensi')
                    ->where('Bidang', $bidang);

        $result = $query->get()->getResultArray();