app/Models/PegawaiJadwalModel.php

    public function getPendingJadwal()
    {
        return $this->select('jadwal_rapat.*, user.Bidang')
                    ->join('user', 'user.user_id = jadwal_rapat.user_id', 'left')
                    ->where('jadwal_rapat.status', 'Belum Disetujui')
                    ->findAll();
---
SELECT `jadwal_rapat`.*, `user`.`Bidang`
FROM `jadwal_rapat`
LEFT JOIN `user` ON `user`.`user_id` = `jadwal_rapat`.`user_id`
WHERE `jadwal_rapat`.`status` = 'Belum Disetujui'