app/Models/UserModel.php

    public function updateUser($user_id, $data)
    {
        $user = $this->find($user_id);

        if (!$user) {
            log_message('error', 'Pengguna dengan ID ' . $user_id . ' tidak ditemukan.');
            return false;
        }

        log_message('info', 'Data pengguna yang ada: ' . print_r($user, true));

        $changes = [];
        foreach ($data as $key => $value) {
            if (isset($user[$key]) && $user[$key] !== $value && !empty($value)) {
                $changes[$key] = $value;
            }
        }

        if (empty($changes)) {
            log_message('info', 'Tidak ada perubahan valid untuk pengguna ID ' . $user_id . '. Pembaruan tidak diperlukan.');
            return false;
        }

        log_message('info', 'Data yang akan diperbarui: ' . print_r($changes, true));

        $this->allowedFields = array_keys($user);

        try {
            $result = $this->update($user_id, $changes);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '9'
UPDATE `user` SET `email` = 'bismillah@gmail.com', `updated_at` = '2025-01-16 07:39:05'
WHERE `user`.`user_id` IN ('9')